Revit 2026 API

# GenericGenericSelfIllumColorTemperature Property

---

The property labeled "Color Temperature" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericSelfIllumColorTemperature { get; }
```
```vb
Public Shared ReadOnly Property GenericSelfIllumColorTemperature As String
	Get
```
```cpp
public:
static property String^ GenericSelfIllumColorTemperature {
	String^ get ();
}
```
```fsharp
static member GenericSelfIllumColorTemperature : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace